index=windows sourcetype="WinEventLog:System" EventCode=4697
| eval service_name=mvindex(split(Service_Name,"/"),-1)
| eval event_type=if(Image_Path LIKE "%System32\\svchost.exe -k %", "System Service", "Non-System Service")
| stats count by _time, service_name, event_type, Image_Path
| where count > 1 AND NOT service_name="NtmsSvc" AND NOT service_name="SENS" AND NOT service_name="SysmonDrv" AND NOT service_name="wuauserv"
